#3. Цифры в столбик

#Условие: Дано натуральное трёхзначное число n. Найдите цифры этого числа.

#Формат входных данных: Вводится целое число  n (100 ≤ n ≤ 999)

#Формат выходных данных: Требуется вывести цифры исходного числа в столбик: сотни, десятки, единицы

n = input()
for i in (n):
    print(i)
